example.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2026-02-25 Wed 10:55 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Example</title>
<meta name="author" content="Your Name" />
<meta name="generator" content="Org Mode" />
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<link rel="preconnect" href="https://fonts.googleapis.com">
<link href="https://fonts.googleapis.com/css2?family=Inter:ital,wght@0,300;0,400;0,500;0,600;1,400&family=Fira+Code:wght@400;500&display=swap" rel="stylesheet">
<link href="https://cdn.jsdelivr.net/npm/bootstrap@5.3.3/dist/css/bootstrap.min.css" rel="stylesheet">
<link href="https://cdn.jsdelivr.net/npm/bootstrap-icons@1.11.3/font/bootstrap-icons.min.css" rel="stylesheet">
<link href="https://cdn.jsdelivr.net/gh/yuqiuj-mob/orgmin-theme@main/css/orgdoc.css" rel="stylesheet">
</head>
<body>
<div id="content" class="content">
<h1 class="title">Example</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org0269691">Introduction</a></li>
<li><a href="#orgc358520">Code Examples</a>
<ul>
<li><a href="#org33fede5">Python</a></li>
<li><a href="#org3550729">Shell</a></li>
</ul>
</li>
<li><a href="#org038351b">Tables</a></li>
<li><a href="#orgdf5d843">Special Blocks</a></li>
<li><a href="#orgb2e4253">Subsection Nesting</a>
<ul>
<li><a href="#org2b10ba5">Level 2 heading</a>
<ul>
<li><a href="#org21ed54c">Level 3 heading</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org0269691" class="outline-2">
<h2 id="org0269691">Introduction</h2>
<div class="outline-text-2" id="text-org0269691">
<p>
This is a sample documentation file using the Bootstrap Org-HTML theme.
Supports nested sections, code blocks with copy buttons, tables, and a
in-page search bar.
</p>
</div>
</div>
<div id="outline-container-orgc358520" class="outline-2">
<h2 id="orgc358520">Code Examples</h2>
<div class="outline-text-2" id="text-orgc358520">
</div>
<div id="outline-container-org33fede5" class="outline-3">
<h3 id="org33fede5">Python</h3>
<div class="outline-text-3" id="text-org33fede5">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #00bcff;">def</span> <span style="color: #ffa00f;">greet</span>(name: <span style="color: #cabf00;">str</span>) <span style="color: #ffffff;">-&gt;</span> <span style="color: #cabf00;">str</span>:
<span style="color: #ffffff; background-color: #1e1e1e;"> </span>   <span style="color: #9ac8e0;">"""Return a friendly greeting."""</span>
<span style="color: #ffffff; background-color: #1e1e1e;"> </span>   <span style="color: #00bcff;">return</span> f<span style="color: #79a8ff;">"Hello, </span>{name}<span style="color: #79a8ff;">!"</span>

<span style="color: #00bcff;">if</span> <span style="color: #cabf00;">__name__</span> <span style="color: #ffffff;">==</span> <span style="color: #79a8ff;">"__main__"</span>:
<span style="color: #ffffff; background-color: #1e1e1e;"> </span>   <span style="color: #cabf00;">print</span>(greet(<span style="color: #79a8ff;">"World"</span>))
</pre>
</div>
</div>
</div>
<div id="outline-container-org3550729" class="outline-3">
<h3 id="org3550729">Shell</h3>
<div class="outline-text-3" id="text-org3550729">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #d8af7a;"># </span><span style="color: #d8af7a;">Export an org file to HTML
</span>emacs --batch <span style="color: #79a8ff;">\</span>
<span style="color: #ffffff; background-color: #1e1e1e;"> </span> --load org <span style="color: #79a8ff;">\</span>
<span style="color: #ffffff; background-color: #1e1e1e;"> </span> --eval <span style="color: #79a8ff;">'(org-html-export-to-html)'</span> <span style="color: #79a8ff;">\</span>
<span style="color: #ffffff; background-color: #1e1e1e;"> </span> myfile.org
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org038351b" class="outline-2">
<h2 id="org038351b">Tables</h2>
<div class="outline-text-2" id="text-org038351b">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-right">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Language</th>
<th scope="col" class="org-left">Paradigm</th>
<th scope="col" class="org-right">Year</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Python</td>
<td class="org-left">Multi</td>
<td class="org-right">1991</td>
</tr>

<tr>
<td class="org-left">Haskell</td>
<td class="org-left">Functional</td>
<td class="org-right">1990</td>
</tr>

<tr>
<td class="org-left">Rust</td>
<td class="org-left">Systems</td>
<td class="org-right">2010</td>
</tr>

<tr>
<td class="org-left">TypeScript</td>
<td class="org-left">Multi</td>
<td class="org-right">2012</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgdf5d843" class="outline-2">
<h2 id="orgdf5d843">Special Blocks</h2>
<div class="outline-text-2" id="text-orgdf5d843">
<div class="warning" id="org0c88ece">
<p>
<b>Warning:</b> Always back up your files before running batch operations.
</p>

</div>

<div class="tip" id="org8790b49">
<p>
<b>Tip:</b> Press <code>M-x org-html-export-to-html</code> inside Emacs to export.
</p>

</div>
</div>
</div>
<div id="outline-container-orgb2e4253" class="outline-2">
<h2 id="orgb2e4253">Subsection Nesting</h2>
<div class="outline-text-2" id="text-orgb2e4253">
</div>
<div id="outline-container-org2b10ba5" class="outline-3">
<h3 id="org2b10ba5">Level 2 heading</h3>
<div class="outline-text-3" id="text-org2b10ba5">
</div>
<div id="outline-container-org21ed54c" class="outline-4">
<h4 id="org21ed54c">Level 3 heading</h4>
<div class="outline-text-4" id="text-org21ed54c">
<p>
Lorem ipsum dolor sit amet, consectetur adipiscing elit. Sed do eiusmod
tempor incididunt ut labore et dolore magna aliqua.
</p>
</div>
<ul class="org-ul">
<li><a id="org4773581"></a>Level 4 heading<br>
<div class="outline-text-5" id="text-org4773581">
<p>
Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris.
</p>
</div>
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Your Name</p>
<p class="date">Created: 2026-02-25 Wed 10:55</p>
</div>
</body>
</html>
